In [38]:
import time
import pandas as pd
import matplotlib.pyplot as plt
import nltk as nltk
from nltk.corpus import stopwords
from nltk.sentiment.vader import SentimentIntensityAnalyzer

Print Shape

In [2]:
reviews = pd.read_csv("Hotel_Reviews.csv")
reviews.shape

(515738, 17)

How many distinct values are there for the column Reviewer_Nationality and what are they?

In [3]:
reviews.head(2)

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,lat,lng
0,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968
1,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Ireland,No Negative,0,1403,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968

In [4]:
reviews['Reviewer_Nationality'].head()

0             Russia
1            Ireland
2          Australia
3     United Kingdom
4        New Zealand
Name: Reviewer_Nationality, dtype: object

In [5]:
pd.DataFrame(reviews['Reviewer_Nationality'].unique())

                              0
0                       Russia
1                      Ireland
2                    Australia
3               United Kingdom
4                  New Zealand
..                          ...
222   Northern Mariana Islands
223                     Tuvalu
224                     Guinea
225             American Samoa
226                      Palau

[227 rows x 1 columns]

In [6]:
for x in reviews['Reviewer_Nationality'].unique():
    print(x)

 Russia
 Ireland
 Australia
 United Kingdom
 New Zealand
 Poland
 Belgium
 Norway
 France
 Italy
 Canada
 Netherlands
 Germany
 United States of America
 Hungary
 Israel
 Switzerland
 India
 United Arab Emirates
 Malaysia
 Denmark
 South Africa
 Rwanda
 Finland
 Portugal
 Luxembourg
 Spain
 Malta
 China
 Turkey
 Ukraine
 Gibraltar
 Argentina
 Abkhazia Georgia
 Isle of Man
 Sweden
 Croatia
 Saudi Arabia
 Lithuania
 Slovenia
 Panama
 Austria
 Brazil
 Taiwan
 Iceland
 Iran
 Liechtenstein
 Chile
 Hong Kong
 United States Minor Outlying Islands
 Morocco
 Oman
 Lebanon
 Qatar
 Nigeria
 Romania
 Czech Republic
 Greece
 Thailand
 Singapore
 Guernsey
 Latvia
 Namibia
 Japan
 Egypt
 Slovakia
 South Korea
 Kuwait
 Bahrain
 Jersey
 Jordan
 Bulgaria
 Cyprus
 Albania
 Estonia
 Serbia
 Belarus
 Puerto Rico
 Sudan
 Sri Lanka
 Indonesia
 Honduras
 Philippines
 Montenegro
 Uruguay
 Brunei
 Pakistan
 Kosovo
 Azerbaijan

 Botswana
 Tanzania
 Bangladesh
 Trinidad and Tobago
 Palestinian Territory
 Peru
 Mexico
 Kenya
 Zimbabwe
 Macedonia
 Georgia
 Bermuda
 Costa Rica
 Bahamas
 Maldives
 Barbados
 Libya
 Fiji
 Angola
 Kazakhstan
 Bosnia and Herzegovina
 Colombia
 Armenia
 Vietnam
 Iraq
 Monaco
 Uganda
 Togo
 Guatemala
 Ghana
 Macau
 Zambia
 Jamaica
 Mauritius
 Venezuela
 Crimea
 St Maarten
 Algeria
 Equatorial Guinea
 Nicaragua
 Comoros
 Cayman Islands
 Ethiopia
 Dominican Republic
 Ecuador
 Uzbekistan
 Turks Caicos Islands
 Nepal
 Mozambique
 Sierra Leone
 Ivory Coast
 Cura ao
 Antigua Barbuda
 Burundi
 East Timor
 Tunisia
 Andorra
 U S Virgin Islands
 Antarctica
 Papua New Guinea
 Montserrat
 Malawi
 Yemen
 Suriname
 Paraguay
 Aruba
 Mongolia
 Moldova
 St Pierre and Miquelon
 Cambodia
 Seychelles
 Guyana
 Senegal
 El Salvador
 Guam
 Myanmar
 Madagascar
 Benin
 Saint Kitts and Nevis
 Martinique
 Vanuatu
 British Virgin Islands
 Belize
 Democratic Republic of the Congo
 Gabon
 New Caledonia
 Bhutan
 Faroe Islands
 Kyrgyzstan
 Gambia
 Syria
 Laos
 Mauritania
 Central Africa Republic
 Reunion
 Saint Martin
 Cameroon
 Guadeloupe
 Liberia
 Haiti
 Mali
 Saint Lucia
 French Guiana
 Swaziland
 Falkland Islands Malvinas
 Tajikistan
 Afghanistan
 Bolivia
 Dominica
 Niger
 Samoa
 Lesotho
 French Polynesia
 Grenada
 Wallis and Futuna
 Svalbard Jan Mayen
 Djibouti
 Saint Barts
 Kiribati
 Cook Islands
 Congo
 Somalia
 Eritrea
 Saint Vincent Grenadines
 San Marino
 Turkmenistan
 Vatican City
 South Sudan
 Anguilla
 Cocos K I
 Bonaire St Eustatius and Saba
 Cape Verde
 Northern Mariana Islands
 Tuvalu
 Guinea
 American Samoa
 Palau

What reviewer nationality is the most common in the dataset (print country and number of reviews)?

In [7]:
most_freq = reviews['Reviewer_Nationality'].value_counts().reset_index()

In [8]:
most_freq.iloc[0:1]

  Reviewer_Nationality   count
0      United Kingdom   245246

What are the next top 10 most frequently found nationalities, and their frequency count?

In [9]:
most_freq.iloc[1:10]

         Reviewer_Nationality  count
1   United States of America   35437
2                  Australia   21686
3                    Ireland   14827
4       United Arab Emirates   10235
5               Saudi Arabia    8951
6                Netherlands    8772
7                Switzerland    8678
8                    Germany    7941
9                     Canada    7894

What was the most frequently reviewed hotel for each of the top 10 most reviewer nationalities?

In [10]:
for nationality in most_freq['Reviewer_Nationality'].iloc[0:10]:
    currNat = reviews[reviews['Reviewer_Nationality'] == nationality]
    hotel = currNat['Hotel_Name'].value_counts().reset_index()['Hotel_Name'][0]
    print(f"The most frequently reviewed hotel in {nationality} is {hotel}")

The most frequently reviewed hotel in  United Kingdom  is Britannia International Hotel Canary Wharf
The most frequently reviewed hotel in  United States of America  is Hotel Esther a
The most frequently reviewed hotel in  Australia  is Park Plaza Westminster Bridge London

The most frequently reviewed hotel in  Ireland  is Copthorne Tara Hotel London Kensington
The most frequently reviewed hotel in  United Arab Emirates  is Millennium Hotel London Knightsbridge
The most frequently reviewed hotel in  Saudi Arabia  is The Cumberland A Guoman Hotel
The most frequently reviewed hotel in  Netherlands  is Jaz Amsterdam
The most frequently reviewed hotel in  Switzerland  is Hotel Da Vinci
The most frequently reviewed hotel in  Germany  is Hotel Da Vinci
The most frequently reviewed hotel in  Canada  is St James Court A Taj Hotel London

How many reviews are there per hotel (frequency count of hotel) in the dataset?

In [11]:
reviews['Hotel_Name'].value_counts().reset_index()

                                             Hotel_Name  count
0            Britannia International Hotel Canary Wharf   4789
1                                   Strand Palace Hotel   4256
2                  Park Plaza Westminster Bridge London   4169
3                Copthorne Tara Hotel London Kensington   3578
4     DoubleTree by Hilton Hotel London Tower of London   3212
...                                                 ...    ...
1487                       Ibis Styles Milano Palmanova     12
1488                                     Hotel Eitlj rg     12
1489                                       Hotel Wagner     10
1490                      Mercure Paris Porte d Orleans     10
1491                                Hotel Gallitzinberg      8

[1492 rows x 2 columns]

Add a new column to your dataframe with the column header Calc_Average_Score that contains that calculated average.

In [12]:
reviews['Calc_Average_Score'] = round(reviews.groupby(['Hotel_Name'])['Reviewer_Score'].transform('mean'))

In [13]:
reviews.head()

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,lat,lng,Calc_Average_Score
0,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968,8.0
1,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Ireland,No Negative,0,1403,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,52.360576,4.915968,8.0
2,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/31/2017,7.7,Hotel Arena,Australia,Rooms are nice but for elderly a bit difficul...,42,1403,Location was good and staff were ok It is cut...,21,9,7.1,"[' Leisure trip ', ' Family with young childre...",3 days,52.360576,4.915968,8.0
3,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/31/2017,7.7,Hotel Arena,United Kingdom,My room was dirty and I was afraid to walk ba...,210,1403,Great location in nice surroundings the bar a...,26,1,3.8,"[' Leisure trip ', ' Solo traveler ', ' Duplex...",3 days,52.360576,4.915968,8.0
4,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,7/24/2017,7.7,Hotel Arena,New Zealand,You When I booked with your company on line y...,140,1403,Amazing location and building Romantic setting,8,3,6.7,"[' Leisure trip ', ' Couple ', ' Suite ', ' St...",10 days,52.360576,4.915968,8.0

Do any hotels have the same (rounded to 1 decimal place) Average_Score and Calc_Average_Score?

In [14]:
reviews[reviews['Average_Score']-reviews['Calc_Average_Score'] <= 0.1]['Hotel_Name'].drop_duplicates()

0                              Hotel Arena
405                       K K Hotel George
2008      The Park Grand London Paddington
3778                   Monhotel Lounge SPA
3832                  The Principal London
                        ...
511962          Suite Hotel 900 m zur Oper
512401                       Hotel Amadeus
512545                        The Berkeley
512645       Holiday Inn London Kensington
515413               Atlantis Hotel Vienna
Name: Hotel_Name, Length: 929, dtype: object

Calculate and print out how many rows have column Negative_Review values of "No Negative"

In [15]:
no_neg = reviews[reviews['Negative_Review'] == 'No Negative']
no_neg.shape[0]

127890

Calculate and print out how many rows have column Positive_Review values of "No Positive"

In [16]:
no_pos = reviews[reviews['Positive_Review'] == 'No Positive']
no_pos.shape[0]

35946

Calculate and print out how many rows have column Positive_Review values of "No Positive" and Negative_Review values of "No Negative"

In [17]:
both = reviews[(reviews['Positive_Review'] == 'No Positive') & (reviews['Negative_Review'] == 'No Negative')]
both.shape[0]

127

In [18]:
pd.DataFrame({"Score":both['Average_Score']})

        Score
1403      9.2
7272      8.4
7892      8.2
21443     8.6
22770     8.4
...       ...
495174    8.5
497108    8.3
498076    7.0
498194    7.0
498341    7.0

[127 rows x 1 columns]

## Data Preprocessing

Drop lat and lng

In [19]:
reviews = reviews.drop(columns=['lat', 'lng'])
reviews.head(2)

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,Calc_Average_Score
0,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,8.0
1,s Gravesandestraat 55 Oost 1092 AA Amsterdam ...,194,8/3/2017,7.7,Hotel Arena,Ireland,No Negative,0,1403,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,8.0

Replace Hotel_Address values with the following values (if the address contains the same of the city and the country, change it to just the city and the country).

These are the only cities and countries in the dataset:
Amsterdam, Netherlands / 
Barcelona, Spain /
London, United Kingdom /
Milan, Italy /
Paris, France /
Vienna, Austria /

In [20]:
def replace_address(x):
    if "Netherlands" in x:
        return "Amsterdam, Netherlands"
    elif "Barcelona" in x:
        return "Barcelona, Spain"
    elif "United Kingdom" in x:
        return "London, United Kingdom"
    elif "Milan" in x:        
        return "Milan, Italy"
    elif "France" in x:
        return "Paris, France"
    elif "Vienna" in x:
        return "Vienna, Austria"
    else:
        return x

In [21]:
reviews['Hotel_Address'] = reviews['Hotel_Address'].apply(replace_address)
reviews.head(2)

,Hotel_Address,Additional_Number_of_Scoring,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,Calc_Average_Score
0,"Amsterdam, Netherlands",194,8/3/2017,7.7,Hotel Arena,Russia,I am so angry that i made this post available...,397,1403,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,8.0
1,"Amsterdam, Netherlands",194,8/3/2017,7.7,Hotel Arena,Ireland,No Negative,0,1403,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,8.0

In [22]:
display(reviews.groupby("Hotel_Address").agg({"Hotel_Name": "nunique"}))

                        Hotel_Name
Hotel_Address
Amsterdam, Netherlands         105
Barcelona, Spain               211
London, United Kingdom         400
Milan, Italy                   162
Paris, France                  458
Vienna, Austria                158

Drop Additional_Number_of_Scoring

In [23]:
reviews = reviews.drop(columns=['Additional_Number_of_Scoring'])

Replace Total_Number_of_Reviews with the total number of reviews for that hotel that are actually in the dataset

In [24]:
reviews['Total_Number_of_Reviews'] = reviews.groupby('Hotel_Name').transform('count')['Hotel_Address']
reviews['Average_Score'] = round(reviews.groupby('Hotel_Name')['Reviewer_Score'].transform('mean'), 1)

In [25]:
reviews.head(2)

,Hotel_Address,Review_Date,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Review_Total_Negative_Word_Counts,Total_Number_of_Reviews,Positive_Review,Review_Total_Positive_Word_Counts,Total_Number_of_Reviews_Reviewer_Has_Given,Reviewer_Score,Tags,days_since_review,Calc_Average_Score
0,"Amsterdam, Netherlands",8/3/2017,7.8,Hotel Arena,Russia,I am so angry that i made this post available...,397,405,Only the park outside of the hotel was beauti...,11,7,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,8.0
1,"Amsterdam, Netherlands",8/3/2017,7.8,Hotel Arena,Ireland,No Negative,0,405,No real complaints the hotel was great great ...,105,7,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",0 days,8.0

Drop Review_Total_Negative_Word_Counts, Review_Total_Positive_Word_Counts, Review_Date and days_since_review

In [26]:
reviews = reviews.drop(columns=['Review_Total_Negative_Word_Counts', 'Review_Total_Positive_Word_Counts','Review_Date','days_since_review'])

Drop Total_Number_of_Reviews_Reviewer_Has_Given

In [27]:
reviews = reviews.drop(columns=['Total_Number_of_Reviews_Reviewer_Has_Given'])

In [28]:
reviews.head(2)

,Hotel_Address,Average_Score,Hotel_Name,Reviewer_Nationality,Negative_Review,Total_Number_of_Reviews,Positive_Review,Reviewer_Score,Tags,Calc_Average_Score
0,"Amsterdam, Netherlands",7.8,Hotel Arena,Russia,I am so angry that i made this post available...,405,Only the park outside of the hotel was beauti...,2.9,"[' Leisure trip ', ' Couple ', ' Duplex Double...",8.0
1,"Amsterdam, Netherlands",7.8,Hotel Arena,Ireland,No Negative,405,No real complaints the hotel was great great ...,7.5,"[' Leisure trip ', ' Couple ', ' Duplex Double...",8.0

In [30]:
reviews["Tags"] = reviews["Tags"].str.strip("[']").replace(" ', '", ",", regex = False)

In [31]:
reviews["Tags"]

0          Leisure trip ', ' Couple ', ' Duplex Double R...
1          Leisure trip ', ' Couple ', ' Duplex Double R...
2          Leisure trip ', ' Family with young children ...
3          Leisure trip ', ' Solo traveler ', ' Duplex D...
4          Leisure trip ', ' Couple ', ' Suite ', ' Stay...
                                ...
515733     Leisure trip ', ' Family with older children ...
515734     Leisure trip ', ' Family with young children ...
515735     Leisure trip ', ' Family with older children ...
515736     Leisure trip ', ' Group ', ' Standard Triple ...
515737     Leisure trip ', ' Family with young children ...
Name: Tags, Length: 515738, dtype: object

In [32]:
reviews["Leisure_trip"] = reviews["Tags"].apply(lambda tag: 1 if "Leisure trip" in tag else 0)
reviews["Couple"] =reviews["Tags"].apply(lambda tag: 1 if "Couple" in tag else 0)
reviews["Solo_traveler"] = reviews["Tags"].apply(lambda tag: 1 if "Solo traveler" in tag else 0)
reviews["Business_trip"] = reviews["Tags"].apply(lambda tag: 1 if "Business trip" in tag else 0)
reviews["Group"] = reviews["Tags"].apply(lambda tag: 1 if "Group" in tag or "Travelers with friends" in tag else 0)
reviews["Family_with_young_children"] = reviews["Tags"].apply(lambda tag: 1 if "Family with young children" in tag else 0)
reviews["Family_with_older_children"] = reviews["Tags"].apply(lambda tag: 1 if "Family with older children" in tag else 0)
reviews["With_a_pet"] = reviews["Tags"].apply(lambda tag: 1 if "With a pet" in tag else 0)

In [34]:
reviews.to_csv('Hotel_Reviews_Cleaned.csv', index = False)

Removing Stopwords

In [43]:
def remove_stopwords(review):
    stop_words = set(stopwords.words("english"))
    text = " ".join([word for word in review.split() if word not in stop_words])
    return text

In [44]:
reviews["Negative_Review"] = reviews["Negative_Review"].apply(remove_stopwords)   
reviews["Positive_Review"] = reviews["Positive_Review"].apply(remove_stopwords)

Calculate Sentiment

In [45]:
def calc_sentiment(review):
    sentiment = SentimentIntensityAnalyzer()  
    if review == "No Negative" or review == "No Positive":
        return 0
    return sentiment.polarity_scores(review)["compound"]

In [54]:
reviews["Negative_Sentiment"] = reviews["Negative_Review"].apply(calc_sentiment)
reviews["Positive_Sentiment"] = reviews["Positive_Review"].apply(calc_sentiment)

0         Iangrymadepostavailableviapossiblesitesuseplan...
1                                                NoNegative
2         Roomsniceelderlybitdifficultroomstwostorynarro...
3         MyroomdirtyIafraidwalkbarefootfloorlookedclean...
4         YouWhenIbookedcompanylineshowedpicturesroomIth...
                                ...
515733                       trollystaffhelptakeluggageroom
515734                            Thehotellookslike3surely4
515735                TheacuselessIthotweekviennagavehotair
515736                                           NoNegative
515737                              I3rdfloorItworkFreeWife
Name: Negative_Review, Length: 515738, dtype: object

Compare the values

In [49]:
print(reviews[["Negative_Review", "Negative_Sentiment"]])
print(reviews[["Positive_Review", "Positive_Sentiment"]])

KeyError: "['Negative_Sentiment'] not in index"

In [ ]:
check_reviews = reviews[(reviews["Negative_Review"]!=reviews["Negative_Sentiment"].astype(int))|(reviews["Positive_Review"]!=reviews["Positive_Sentiment"]).astype(int)]
check_reviews.value_counts()

In [ ]:
reviews = reviews[["Hotel_Name", "Hotel_Address", "Total_Number_of_Reviews", "Average_Score", "Reviewer_Score", "Negative_Sentiment", "Positive_Sentiment", "Reviewer_Nationality", "Leisure_trip", "Couple", "Solo_traveler", "Business_trip", "Group", "Family_with_young_children", "Family_with_older_children", "With_a_pet", "Negative_Review", "Positive_Review"]]
reviews.to_csv("Hotel_Reviews_NLP.csv", index = False)